TexasInstruments/mcupsdk-core/examples/kernel/freertos/task_switch_mpu/am261x-som/r5fss0-0_freertos_mpu/example.syscfg
section14.$name                                    = "Privileged Data Segments";
section14.load_memory                              = "PRIVILEGED_DATA";
section14.group_start                              = "__privileged_data_start__";
section14.group_end                                = "__privileged_data_end__";
section14.output_section.create(2);
section14.output_section[0].$name                  = ".privileged_data";
section14.output_section[0].palignment             = true;
section14.output_section[0].input_section.create(1);
section14.output_section[0].input_section[0].$name = "*(privileged_data)";
section14.output_section[1].$name                  = ".data.task_switch_mpu.privileged";
section14.output_section[1].palignment             = true;
section14.output_section[1].input_section.create(1);
section14.output_section[1].input_section[0].$name = "task_switch_mpu.o*(.data, .bss)";

section15.load_memory                              = "PING_TEXT";
section15.$name                                    = "Ping Task Text Sections ";
section15.group_start                              = "__TEXT_PING_START";
section15.group_end                                = "__TEXT_PING_END";
section15.output_section.create(1);
section15.output_section[0].$name                  = ".text.task_switch_mpu.ping";
section15.output_section[0].macro_name             = "TEXTTASK_SWITCH_MPUPING_SECTION";
section15.output_section[0].palignment             = true;
section15.output_section[0].input_section.create(1);
section15.output_section[0].input_section[0].$name = "task_switch_mpu_ping.o*(.text)";

section16.group_start                              = "__DATA_PING_START";
section16.group_end                                = "__DATA_PING_END";
section16.load_memory                              = "PING_DATA";
section16.$name                                    = "Ping Task Data Sections ";
section16.output_section.create(1);
section16.output_section[0].$name                  = ".data.task_switch_mpu.ping";
section16.output_section[0].palignment             = true;
section16.output_section[0].input_section.create(1);
section16.output_section[0].input_section[0].$name = "task_switch_mpu_ping.o*(.data, .bss)";

section17.$name                                    = "Pong Task Text Sections";
section17.group_start                              = "__TEXT_PONG_START";
section17.group_end                                = "__TEXT_PONG_END";
section17.load_memory                              = "PONG_TEXT";
section17.output_section.create(1);
section17.output_section[0].macro_name             = "TEXTTASK_SWITCH_MPUPING_SECTION";
section17.output_section[0].palignment             = true;
section17.output_section[0].$name                  = ".text.task_switch_mpu.pong";
section17.output_section[0].input_section.create(1);
section17.output_section[0].input_section[0].$name = "task_switch_mpu_pong.o*(.text)";

section18.group_start                              = "__DATA_PONG_START";
section18.group_end                                = "__DATA_PONG_END";
section18.load_memory                              = "PONG_DATA";
section18.$name                                    = "Pong Task Data Sections";
section18.output_section.create(1);
section18.output_section[0].palignment             = true;
section18.output_section[0].$name                  = ".data.task_switch_mpu.pong";
section18.output_section[0].input_section.create(1);
section18.output_section[0].input_section[0].$name = "task_switch_mpu_pong.o*(.data, .bss)";
